scripts/loadtest.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 3
      arrivalRate: 2
      name: Startup phase
scenarios:
  - flow:
      - get:
          url: '/customers'
          headers:
            Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJkYXRhIjoiZGF0YSIsImlhdCI6MTcxOTU5NzE3NCwiZXhwIjoxNzE5NTk3NDc0fQ.y0qgHBumg6Ks18LSXIN7oHv0jJfVgckW1Vs8FQf-YWA'